Repository: elixirschool/school_house
Catalog: priv/gettext/*/LC_MESSAGES/default.po
Languages: el, es, ja, no

source: Basics
el: Βασικά
es: Base
ja: 初級
no: Grunnleggende

source: Collections
el: Συλλογές
es: Colecciones
ja: コレクション
no: Samlinger

source: Control Structures
el: Δομές Ελέγχου
es: Estructuras de control
ja: 制御構造
no: Kontrollstrukturer

source: Functions
el: Συναρτήσεις
es: Funciones
ja: 関数
no: Funksjoner

source: Modules
el: Ενότητες
es: Módulos
ja: モジュール
no: Moduler

source: Pattern Matching
el: Αντιπαραβολές Προτύπων
es: Macheo de patrones
ja: パターンマッチング

source: Pipe Operator
el: Τελεστής Σωλήνα
es: Operador Pipe
ja: パイプライン演算子

source: Advanced
el: Προχωρημένα
es: Avanzado
ja: 上級
no: Avansert

source: Associations
el: Συσχετισμοί
es: Asociaciones
ja: アソシエーション
no: Assosiasjoner

source: Behaviours
el: Συμπεριφορές
es: Comportamientos
ja: ビヘイビア
no: Oppførsel

source: Changesets
el: Σετ αλλαγών
es: Conjuntos de cambios
ja: チェンジセット

source: Comprehensions
el: Ανάγνωση Λιστών
es: Comprensiones
ja: 内包表記
no: Komprehensjoner

source: Concurrency
el: Συγχρονισμός
es: Concurrencia
ja: 並行性

source: Custom Mix Tasks
el: Ειδικές Εργασίες Mix
es: Tareas personalizadas de Mix
ja: カスタムMixタスク
no: Egendefinerte Mix Tasks

source: Data Processing
el: Επεξεργασία δεδομένων
es: Procesamiento de datos
ja: データ処理
no: Dataprosessering

source: Date and Time
el: Ημερομηνία και Ώρα
es: Fecha y hora
ja: 日付と時間
no: Dato og tid

source: Documentation
el: Τεκμηρίωση
es: Documentación
ja: ドキュメント
no: Dokumentasjon

source: Erlang Interoperability
el: Διαλειτουργικότητα με την Erlang
es: Interoperabilidad con Erlang
ja: Erlangとの相互運用
no: Erlang Interoperabilitet

source: Error Handling
el: Διαχείριση Σφαλμάτων
es: Manejo de errores
ja: エラーハンドリング
no: Feilhåndtering

source: Executables
el: Εκτελέσιμα
es: Ejecutables
ja: 実行ファイル
no: Kjørbare filer

source: IEX Helpers
el: Βοηθοί IEx
es: Funciones de ayuda de IEX
no: IEX Hjelpere

source: Intermediate
el: Ενδιάμεσα
es: Intermedio
ja: 中級
no: Middels

source: Metaprogramming
el: Μεταπρογραμματισμός
es: Metaprogramación
ja: メタプログラミング
no: Metaprogrammering

source: Miscellaneous
el: Διάφορα
es: Misceláneo
ja: その他
no: Diverse

source: OTP Concurrency
el: Συγχρονισμός OTP
es: Concurrencia OTP
ja: OTPの並行性

source: OTP Distribution
el: Η Κατανομή στο OTP
es: Distribución OTP
ja: OTPディストリビューション
no: OTP Distribusjon

source: OTP Supervisors
el: Επιτηρητές OTP
es: Supervisores OTP
ja: OTPスーパバイザ
no: OTP Overvåkere

source: Protocols
el: Πρωτόκολλα
es: Protocolos
ja: プロトコル
no: Protokoller

source: Querying: Advanced
el: Δημιουργώντας Ερωτήματα: Προχωρημένο
es: Consultas: Avanzado
ja: クエリ: 応用
no: Spørringer: Avansert

source: Querying: Basics
el: Δημιουργώντας Ερωτήματα: Βασικό
es: Consultas: Básico
ja: クエリ: 基本
no: Spørringer: Grunnleggende

source: Sigils
el: Σφραγίδες
es: Sigilos
ja: シギル

source: Specifications and types
el: Προδιαγραφές και τύποι
es: Especificaciones y tipos
ja: 仕様と型
no: Spesifikasjoner og typer

source: Storage
el: Αποθήκευση
es: Almacenamiento
ja: ストレージ
no: Lagring

source: Strings
el: Αλφαριθμητικά
es: Cadenas de texto
ja: 文字列
no: Strenger

source: Testing
el: Δοκιμές
es: Pruebas
ja: テスト

source: Umbrella Projects
el: Projects Ομπρέλας
es: Proyectos Umbrella
ja: アンブレラプロジェクト
no: Umbrella Prosjekter

source: library
el: βιβλιοθήκη
es: biblioteca
ja: ライブラリ
no: bibliotek

source: Scalable
el: Κλιμακούμενη
es: Escalable
ja: スケーラブル
no: Skalerbar

source: Why Elixir?
el: Γιατί Elixir;
es: ¿Por qué Elixir?
ja: なぜElixir？
no: Hvorfor Elixir?

source: Lesson
el: Μάθημα
es: Lección
ja: レッスン
no: Leksjon

source: Original Version
el: Αρχική Έκδοση
es: Versión original
ja: オリジナルバージョン
no: Opprinnelig versjon

source: Translated Title
el: Μεταφρασμένος Τίτλος
es: Título traducido
ja: 翻訳タイトル
no: Oversatt tittel

source: Translated Version
el: Μεταφρασμένη Έκδοση
es: Versión traducida
ja: 翻訳バージョン
no: Oversatt versjon

source: Translation Report
el: Έκθεση Μετάφρασης
es: Informe de traducción
ja: 翻訳レポート
no: Oversettelsesrapport

source: A Slack alternative built with Elixir is fast becoming a popular chat option for the community.
el: Μια εναλλακτική λύση στο Slack, που δημιουργήθηκε με Elixir γίνεται γρήγορα δημοφιλής επιλογή συνομιλίας για την κοινότητα.
es: Una alternativa a Slack construida con Elixir está convirtiéndose rápidamente en una opción de chat popular para la comunidad.
ja: コミュニティで人気のチャットオプションになりつつあります。
no: Et alternativ til Slack bygget med Elixir. Er nå en av verdens største platformer for chatting og nettsamfunn.

source: An error occurred.
el: Παρουσιάστηκε σφάλμα.
es: Ocurrió un error.
ja: エラーが発生しました。
no: En feil har oppstått

source: Announcements
el: Ανακοινώσεις
es: Anuncios
ja: お知らせ
no: Kunngjøringer

source: Articles authored by Elixir School contributors and members of the community.
el: Άρθρα που συντάχθηκαν από συντελεστές του Elixir School και μέλη της κοινότητας.
es: Artículos escritos por los colaboradores y miembros de la comunidad de Elixir School.
ja: Elixir Schoolの貢献者やコミュニティメンバーによって執筆された記事です。
no: Artikler skrevet av Elixir School bidragsytere og medlemmer av samfunnet.

source: As you read lessons, if you see an opportunity for improvement go ahead and create a pull request with the change, the next reader will thank you. Steps for translating a lesson
el: Καθώς διαβάζετε τα μαθήματα, εάν δείτε μια ευκαιρία για βελτίωση, να προχωρήσετε στη δημιουργία pull request με την αλλαγή, ο επόμενος αναγνώστης θα σας ευχαριστεί. Βήματα για τη μετάφραση ενός μαθήματος
es: Mientras lees las lecciones, si ves una oportunidad de mejora, adelante y crea un pull request con el cambio, el próximo lector te lo agradecerá. Pasos para traducir una lección
ja: レッスンを読んでいて、改善の余地があると思ったら、先にプルリクエストを作成して変更を加えておくと、次の読者があなたに感謝するでしょう。レッスンを翻訳するための手順
no: Hvis du ser en mulighet for forbedring, mens du leser leksjonene, opprett gjerne en pull request med dine forslag Neste leser vil takke deg. Steg for å oversette en leksjon

source: Be sure to check it out!
el: Να το τσεκάρετε σιγουρα!
es: ¡Asegúrate de echarle un vistazo!
ja: ぜひチェックしてみてください！
no: Sjekk det ut!

source: Be sure to follow the popular Elixir hashtags
el: Φροντίστε να ακολουθήσετε τα δημοφιλή Elixir hashtags
es: Asegúrate de seguir los hashtags populares de Elixir
ja: Elixirの人気のハッシュタグ
no: Følg de populære Elixir hashtaggene

source: Building on upon our foundation these lessons introduce topics like concurrency, error handling, and interoperability.
el: Με βάση τα θεμέλιά μας, αυτά τα μαθήματα εισάγουν θέματα όπως ο συγχρονισμός, ο χειρισμός σφαλμάτων και η διαλειτουργικότητα.
es: Construyendo sobre nuestra base, estas lecciones introducen temas como concurrencia, manejo de errores e interoperabilidad.
no: Bygger på fundamentet fra de grunnleggende leksjonene. Disse leksjonene introduserer emner om concurrency, feilhåndtering og interoperabilitet.

source: Built on the back of a giant, the Erlang runtime system, Elixir takes things even further with easy extensibility, compatibility with Erlang and other BEAM languages, and an ever expanding collection of libraries and packages to improve developer happiness.
el: Χτισμένη στην πλάτη ενός γίγαντα, του συστήματος εκτέλεσης Erlang, η Elixir προχωρά ακόμη περισσότερο με εύκολη επεκτασιμότητα, συμβατότητα με την Erlang και άλλες γλώσσες BEAM και μια συνεχώς διευρυνόμενη συλλογή βιβλιοθηκών και πακέτων για τη βελτίωση της ευτυχίας των προγραμματιστών.
es: Construido sobre la espalda de un gigante, el sistema de tiempo de ejecución Erlang, Elixir va aún más lejos con una fácil extensibilidad, compatibilidad con Erlang y otros lenguajes BEAM, y una colección cada vez más amplia de bibliotecas y paquetes para mejorar la felicidad del desarrollador.
ja: Erlangという巨大なランタイムシステムを背景に作られたElixirは、簡単な拡張性、Erlangや他のBEAM言語との互換性、そして開発者の幸福度を向上させるために常に拡張されるライブラリやパッケージのコレクションによって、さらに進化を遂げました。
no: Bygget på skuldrene til en kjempe, Erlang, tar Elixir ting enda lenger med enkel utvidbarhet, kompatibilitet med Erlang og andre BEAM språk, og en stadig voksende samling av biblioteker og pakker for å forbedre utvikleropplevelsen.

source: Bundled with Elixir is the venerable ExUnit library providing everything necessary to comprehensively test your applications.
el: Πακέτο με την Elixir έρχεται η αξιοσέβαστη βιβλιοθήκη ExUnit που παρέχει όλα τα απαραίτητα για τη συνολική δοκιμή των εφαρμογών σας.
es: Incluido con Elixir está la venerable biblioteca ExUnit que proporciona todo lo necesario para probar exhaustivamente sus aplicaciones.
ja: Elixirには、アプリケーションを包括的にテストするために必要なすべてのものを提供する、由緒あるExUnitライブラリがバンドルされています。
no: Pakket sammen med Elixir, får man den anerkjente pakken ExUnit som gir deg alt du trenger for å skrive gjennomført gode tester for din applikasjon.

source: By
el: Από
es: Por
no: City

source: By The Numbers
el: Σε Αριθμούς
es: Por los números
ja: 数字から見る
no: Tall og fakta

source: By eliminating the ability to mutate state outside of scope, functional programs are often easier to follow and contain fewer bugs.
el: Με την εξάλειψη της δυνατότητας μετάλλαξης κατάστασης εκτός του πεδίου εφαρμογής, τα συναρτησιακά προγράμματα είναι συχνά πιο εύκολο να ακολουθηθούν και περιέχουν λιγότερα σφάλματα.
es: Al eliminar la capacidad de mutar el estado fuera del alcance, los programas funcionales suelen ser más fáciles de seguir y contienen menos errores.
ja: スコープ外で状態を変化させる機能を排除することで、関数型プログラムはしばしば追跡が容易になり、バグも少なくなります。
no: Ved å eliminere muligheten til å endre tilstand utenfor scope, er funksjonelle programmer ofte lettere å lese og inneholder som regel færre feil.

source: By focusing on breaking problems down into simple side-effect free functions we can ensure fewer bugs, better test coverage, while incrementally building our solutions through the composition of well tested functions.
el: Εστιάζοντας στον διαχωρισμό των προβλημάτων σε απλές λειτουργίες χωρίς παρενέργειες, μπορούμε να εξασφαλίσουμε λιγότερα σφάλματα, καλύτερη κάλυψη δοκιμών, ενώ χτίζουμε σταδιακά τις λύσεις μας μέσω της σύνθεσης καλά ελεγμένων λειτουργιών.
es: Al centrarse en dividir los problemas en funciones simples sin efectos secundarios, podemos asegurar menos errores, mejor cobertura de pruebas, mientras construimos nuestras soluciones de forma incremental a través de la composición de funciones bien probadas.
ja: 問題をシンプルで副作用のない関数に分けることで、バグを減らし、テストカバー率を向上させ、よくテストされた関数の組み合わせによって解決策を段階的に構築していくことができます。
no: Ved å fokusere på å dele opp problemer i enkle enkeltstående funksjoner uten bivirkninger, kan vi være sikre på færre feil, bedre testdekning, mens vi gradvis bygger løsninger gjennom oppbygning av godt testede funksjoner.

source: Caught a mistake or want to contribute to the lesson?
el: Έπιασες λάθος ή θέλεις να συνεισφέρεις στο μάθημα;
es: ¿Capturaste un error o quieres contribuir a la lección?
ja: 間違いを報告したい、あるいはこのレッスンに貢献したい？
no: Har du oppdaget en feil eller ønsker å bidra til leksjonen?

source: Check out all of the conferences that focus on Elixir!
el: Δείτε όλα τα συνέδρια που επικεντρώνονται στην Elixir!
es: ¡Echa un vistazo a todas las conferencias que se centran en Elixir!
ja: Elixirに焦点が当てられている全てのカンファレンスをチェックしよう！
no: Sjekk ut alle konferansene som fokuserer på Elixir!

source: Check out all the great of Podcasts that focus on Elixir and the BEAM ecosystem!
el: Δείτε όλα τα υπέροχα Podcast που εστιάζουν στην Elixir και στο οικοσύστημα BEAM!
es: ¡Echa un vistazo a todos los grandes Podcasts que se centran en Elixir y el ecosistema BEAM!
ja: ElixirとBEAM仮想マシンに焦点が当てられている全てのポッドキャストをチェックしよう！
no: Sjekk ut alle de flotte podcastene som fokuserer på Elixir og BEAM-ekosystemet!

source: Coming Soon
es: Próximamente
ja: 近日公開！
no: Kommer snart

source: Companies
el: Εταιρίες
es: Empresas
ja: の会社が
no: Selskaper

source: Compatible with Erlang
el: Συμβατή με την Erlang
es: Compatible con Erlang
ja: Erlangとの互換性
no: Kompatibel med Erlang

source: Conferences
el: Συνέδρια
es: Conferencias
ja: カンファレンス
no: Konferanser

source: Contribute to the Blog
el: Συνεισφέρετε στο Blog
es: Contribuye al blog
ja: ブログへの貢献
no: Bidra til bloggen

source: Country
el: Χώρα
es: País
ja: 国
no: Land

source: Data is not mutated, rather transformed, into a new set of data.
el: Τα δεδομένα δεν μεταλλάσσονται, αλλά μετατρέπονται σε ένα νέο σύνολο δεδομένων.
es: Los datos no se mutan, sino que se transforman en un nuevo conjunto de datos.
ja: データは変更されるのではなく、新しく変換されたデータの集合となります。
no: Data er ikke mutert, men heller transformert til et nytt sett med data.

source: Date
el: Ημερομηνία
es: Fecha
ja: 日付
no: Dato

source: Debugging
es: Depuración
ja: デバッグ
no: Feilsøking

source: Discover why Elixir's popularity has skyrocketed and new companies adopt it daily.
el: Ανακαλύψτε γιατί η δημοτικότητα της Elixir έχει εκτοξευθεί και νέες εταιρίες την υιοθετούν καθημερινά.
es: Descubre por qué la popularidad de Elixir ha aumentado vertiginosamente y nuevas empresas lo adoptan diariamente.
ja: Elixirの人気が急上昇し、日々新しい企業が導入している理由を紹介します。
no: Oppdag hvorfor Elixirs popularitet har skutt fart og hvorfor nye selskaper adopterer det daglig.

source: Easy to Test
el: Εύκολη στις δοκιμές
es: Fácil de probar
ja: テストが容易
no: Lett å teste

source: Edit this lesson on GitHub!
el: Επεξεργαστείτε αυτό το μάθημα στο GitHub!
es: ¡Edita esta lección en GitHub!
ja: このレッスンをGitHubで編集しよう！
no: Rediger denne leksjonen på GitHub!

source: Elixir Conferences
el: Συνέδρια Elixir
es: Conferencias de Elixir
ja: Elixir カンファレンス
no: Elixir-konferanser

source: Elixir Forum
es: Foro de Elixir
ja: Elixirフォーラム

source: Elixir Podcasts
es: Podcasts de Elixir
ja: Elixirポッドキャスト
no: Elixir Podcaster

source: Elixir School is an open source project, with code hosted on
el: Το Elixir School είναι ένα έργο ανοιχτού κώδικα, με κώδικα που φιλοξενείται στο
es: Elixir School es un proyecto de código abierto, con el código alojado en
ja: Elixir Schoolはオープンソースプロジェクトで、ソースコードはこちらから見れます：
no: Elixir School er et open source-prosjekt, med kode som er lagret på

source: Elixir School is built by contributors, skilled and new alike! Help us make it better and extend the reach of Elixir to anyone that wants to learn. Below are a few ways to contribute.
el: Το Elixir School χτίζεται από συνεισφέροντες, έμπειρους και νέους! Βοηθήστε μας να το κάνουμε καλύτερο και να επεκτείνουμε την εμβέλεια την Elixir σε όποιον θέλει να μάθει. Παρακάτω είναι μερικοί τρόποι συνεισφοράς.
es: ¡Elixir School está construido por contribuyentes, expertos y principiantes! Ayúdanos a hacerlo mejor y ampliar el alcance de Elixir a cualquiera que quiera aprender. A continuación se muestran algunas formas de contribuir.
ja: Elixir Schoolは、ベテランも初心者も関係なく、貢献者によって築き上げられました。Elixir Schoolをより良いものにし、Elixirを学びたい人たちへ輪を広げていきましょう。以下は、貢献するためのいくつかの方法です。
no: Elixir School er bygget av bidragsytere, både erfarne og nye! Hjelp oss med å gjøre det bedre og utvide Elixirs rekkevidde til alle som ønsker å lære. Under er noen måter å bidra på.

source: Elixir School is the premier destination for people looking to learn and master the Elixir programming language.
el: Το Elixir School είναι ο κορυφαίος προορισμός για άτομα που θέλουν να μάθουν και να κατακτήσουν τη γλώσσα προγραμματισμού Elixir.
es: Elixir School es el destino preferido para las personas que buscan aprender y dominar el lenguaje de programación Elixir.
ja: Elixir SchoolはElixirを学び、マスターするための最高の場所です。
no: Elixir School er det fremste reisemålet for folk som ønsker å lære og mestre programmeringsspråket Elixir.

source: Elixir and the BEAM virtual machine pack a serious punch when it comes to features. With over 35 years of experience the Erlang runtime system has proven itself time and time again as solid platform for distributed, high-available systems.
el: Η Elixir και η εικονική μηχανή BEAM εντυπωσιάζουν όσον αφορά τα χαρακτηριστικά. Με περισσότερα από 35 χρόνια εμπειρίας, το σύστημα εκτέλεσης Erlang έχει αποδειχθεί ξανά και ξανά ως σταθερή πλατφόρμα για κατανεμημένα, υψηλής διαθεσιμότητας συστήματα.
es: Elixir y la máquina virtual BEAM ofrecen un golpe serio cuando se trata de características. Con más de 35 años de experiencia, el sistema de tiempo de ejecución Erlang se ha demostrado una y otra vez como una plataforma sólida para sistemas distribuidos y de alta disponibilidad.
ja: ElixirとBEAM仮想マシンは、機能面でも非常に優れています。Erlangランタイムシステムは35年以上の間、分散型高可用性システムのための強固なプラットフォームとして証明されてきました。
no: Elixir og den virtuelle maskinvaren BEAM pakker en real skuddsalve av funksjoner. Med over 35 års erfaring har Erlang bevist gang på gang at det er en solid plattform for distribuerte, høytilgjengelige systemer.

source: Elixir is a wonderful language but don't take our word for it. Let's look at some of the reasons you and your organization should adopt Elixir.
el: Η Elixir είναι μια υπέροχη γλώσσα, αλλά μην βασίζεστε στα λόγια μας για αυτό. Ας δούμε μερικούς από τους λόγους που εσείς και ο οργανισμός σας πρέπει να υιοθετήσετε την Elixir.
es: Elixir es un lenguaje maravilloso, pero no nos creas a nosotros. Veamos algunas de las razones por las que tu organización debería adoptar Elixir.
ja: Elixirは素晴らしい言語ですが、私たちの言葉を鵜呑みにしないでください。ここで、あなたとあなたの組織がElixirを採用すべき理由をいくつか見てみましょう。
no: Elixir er et fantastisk språk, men ikke ta vårt ord på det. La oss se på noen av grunnene til at du og din bedrift burde velge Elixir.

source: Email address
el: Διεύθυνση ηλεκτρονικού ταχυδρομείου
es: Dirección de correo electrónico
ja: Eメール
no: Epost-adresse

source: Embedded Elixir (EEx)
es: Elixir embebido (EEx)
ja: 埋め込みElixir (EEx)

source: Enter your email
el: Συμπληρώστε το email σας
es: Introduce tu correo electrónico
ja: Eメールを入力
no: Fyll ut din epost-adresse

source: Explore how interact with the BEAM's built in data storage, Redis, and others.
el: Εξερευνήστε πώς αλληλεπιδράτε με την ενσωματωμένη αποθήκευση δεδομένων του BEAM, το Redis και άλλα.
es: Explore cómo interactuar con el almacenamiento de datos integrado en el BEAM, Redis y otros.
ja: BEAMに内蔵されたデータストレージ、Redisなどとの連携方法を探す。
no: Utforsk hvordan du kan interagere med BEAMs innebygde dataoppbevaring, Redis og andre løsninger.

source: Fault Tolerant
el: Ανεκτική σε σφάλματα
es: Tolerante a fallos
ja: 耐障害性
no: Feil-tolerant

source: Feature Packed
el: Γεμάτη Χαρακτηριστικά
es: Características
ja: 機能満載
no: Funksjonsrik

source: Filter
el: Φίλτρο
es: Filtrar
ja: フィルター
no: Filtrer

source: Focus on Functions
el: Εστίαση στις Λειτουργίες
es: Enfoque en funciones
ja: 関数重視
no: Fokus på funksjoner

source: Forum
es: Foro
ja: フォーラム

source: Functional Programming
el: Συναρτησιακός Προγραμματισμός
es: Programación funcional
ja: 関数型プログラミング
no: Funksjonell programmering

source: Get Involved
el: Πάρτε μέρος
es: Participa
ja: 貢献する
no: Bli med

source: Getting Started
el: Ξεκινώντας
es: Empezando
ja: 始める
no: Kom i gang

source: Hashtags
es: Etiquetas
ja: ハッシュタグ
no: Hashtagger

source: Have a topic related to Elixir that you are knowledgeable about and want to share? Write a blog post and it could be featured on the Elixir School post feed.
el: Έχετε ένα θέμα σχετικά με την Elixir που γνωρίζετε και θέλετε να το μοιραστείτε; Γράψτε μια ανάρτηση ιστολογίου και θα μπορούσε να εμφανιστεί στη ροή αναρτήσεων του Elixir School.
es: ¿Tiene un tema relacionado con Elixir que conoce y desea compartir? Escriba una publicación de blog y podría ser publicada en el feed de publicaciones de Elixir School.
ja: Elixirに関連するトピックをお持ちで、それについて知識があり、共有したいとお考えですか？ブログ記事を書くと、Elixir Schoolの記事フィードで紹介されるかもしれません。
no: Har du et emne relatert til Elixir som du kan mye om og ønsker å dele? Skriv en bloggpost og du kan kan få den publisert på vår blogg.

source: Home
el: Αρχική
es: Inicio
ja: ホーム
no: Hjem

source: Immutability
el: Σταθερότητα
es: Inmutabilidad
ja: 不変性
no: Immutabilitet

source: Improve the Website
el: Βελτιώστε την Ιστοσελίδα
es: Mejora el sitio web
ja: Webサイトの向上
no: Forbedre nettsiden

source: Interacting with data is a part of most applications. These lessons explore the Ecto library and how to leverage it for our database interactions.
el: Η αλληλεπίδραση με δεδομένα είναι μέρος των περισσότερων εφαρμογών. Αυτά τα μαθήματα εξερευνούν τη βιβλιοθήκη Ecto και πως να την αξιοποιήσουμε για τις αλληλεπιδράσεις με τη βάση δεδομένων μας.
es: Interactuar con los datos es parte de la mayoría de las aplicaciones. Estas lecciones exploran la biblioteca Ecto y cómo aprovecharla para nuestras interacciones con la base de datos.
ja: データとの相互作用は、ほとんどのアプリケーションの一部です。このレッスンでは、Ectoライブラリと、データベースの操作にEctoを活用する方法について学びます。
no: Interaksjon med data er noe de fleste applikasjoner gjør. Disse leksjonene utforsker pakken Ecto og hvordan du kan bruke det til dine database-interaksjoner.

source: Join the Elixir School newsletter to keep up with the latest lessons, blog posts, and opportunities within the community.
el: Εγγραφείτε στο ενημερωτικό δελτίο του Elixir School για να παρακολουθείτε τα τελευταία μαθήματα, τις αναρτήσεις ιστολογίου και τις ευκαιρίες στην κοινότητα.
es: Únete al boletín de Elixir School para mantenerte al día con las últimas lecciones, publicaciones de blog y oportunidades dentro de la comunidad.
ja: Elixir Schoolのニュースレターに登録すると、最新のレッスン、ブログ記事、コミュニティ内の機会について知ることができます。
no: Meld deg på vårt nyhetsbrev for å holde deg oppdatert på de siste leksjonene, bloggpostene og mulighetene i fellesskapet.

source: Languages
el: Γλώσσες
es: Idiomas
ja: カ国語
no: Språk

source: Learn More
el: Μάθετε περισσότερα
es: Aprende más
ja: もっと知る
no: Lær mer

source: Lessons
el: Μαθήματα
es: Lecciones
ja: レッスン
no: Leksjoner

source: Lessons covering the foundational topics. New to Elixir? This is the place to start.
el: Μαθήματα που καλύπτουν τα θεμελιώδη θέματα. Νέοι στην Elixir; Αυτό είναι το μέρος για να ξεκινήσετε.
es: Lecciones que cubren los temas fundamentales. ¿Nuevo en Elixir? Este es el lugar para comenzar.
ja: レッスンでは、基本的なトピックをカバーしています。Elixirは初めてですか？ここがスタート地点です。
no: Leksjoner som dekker grunnleggende emner. Ny til Elixir? Her er stedet å starte.

source: Lessons on Elixir School are translated into 25 different languages! If there is a lesson missing a translation that you can provide, translate it and create a pull request.
el: Τα μαθήματα στο Elixir School μεταφράζονται σε 25 διαφορετικές γλώσσες! Εάν λείπει μετάφραση που μπορείτε να παρέχετε σε κάποιο μάθημα, μεταφράστε το και δημιουργήστε ένα pull request.
es: ¡Las lecciones de Elixir School se traducen a 25 idiomas diferentes! Si hay una lección que falta una traducción que pueda proporcionar, tradúzcala y cree una solicitud de extracción.
ja: Elixir Schoolのレッスンは25ヶ国語に翻訳されています！もし、翻訳が必要なレッスンがあれば、翻訳してプルリクエストを作成してください。
no: Leksjonene på Elixir School er oversatt til 25 forskjellige språk! Hvis det er en leksjon som mangler en oversettelse i et språk du kan, kan du gjerne oversette den og opprette en pull request.

source: Location
el: Τοποθεσία
es: Ubicación
ja: ロケーション
no: Sted

source: Meetups
el: Συναντήσεις
es: Encuentros
ja: ミートアップ

source: More to come...
el: Ακολουθούν περισσότερα...
es: Más por venir...
ja: まだまだ他にもたくさん...
no: Mer kommer...

source: Name
el: Όνομα
es: Nombre
ja: 名前
no: Navn

source: Next Lesson
el: Επόμενο Μάθημα
es: Próxima lección
ja: 次のレッスン
no: Neste leksjon

source: Notify me
el: Ειδοποίησέ με
es: Notifícame
ja: 通知する
no: Varsle meg

source: On Hex
el: Στο Hex
es: En Hex
ja: がHexにあります
no: Om Hex

source: Online
es: En línea
ja: オンライン

source: Packages
el: Πακέτα
es: Paquetes
ja: パッケージもの
no: Pakker

source: Page not found
el: Η σελίδα δεν βρέθηκε
es: Página no encontrada
ja: ページが見つかりませんでした
no: Siden ble ikke funnet

source: Performant
el: Αποδοτική
es: Rendimiento
ja: 高性能
no: Effektiv

source: Prefer the forum format for your questions? No problem! Head over to
el: Προτιμάτε τη μορφή του φόρουμ για τις ερωτήσεις σας; Κανένα πρόβλημα! Κατευθυνθείτε προς
es: ¿Prefieres el formato de foro para tus preguntas? ¡No hay problema! Dirígete a
ja: フォーラム形式での質問がお好きですか？大丈夫！
no: Foretrekker du å stille dine spørsmål i et forum? Ikke noe stress! Gå til

source: Presents
el: Παρουσιάζει
es: Presentaciones
no: Presenterer

source: Previous Lesson
el: Προηγούμενο Μάθημα
es: Lección anterior
ja: 前のレッスン
no: Forrige leksjon
