Repository: elixirschool/school_house
Catalog: priv/gettext/*/LC_MESSAGES/default.po
Languages: el, es, ja, no

source: Privacy Policy
el: Πολιτική Απορρήτου
es: Política de privacidad
ja: プライバシーポリシー
no: Personvern

source: Problems are decomposed into simple functions with an emphasis on no side-effects.
el: Τα προβλήματα αναλύονται σε απλές συναρτήσεις με έμφαση στην απουσία παρενεργειών.
es: Los problemas se descomponen en funciones simples con énfasis en no tener efectos secundarios.
ja: 問題は単純な機能に分解され、副作用がないことが重視されます。
no: Problemer brytes ned til enkle funksjoner med fokus på at de ikke har noen sideeffekter.

source: Processing large amount of data concurrently comes easy to Elixir. We'll explore how to leverage libraries to make this task even easier.
el: Η ταυτόχρονη επεξεργασία μεγάλου όγκου δεδομένων είναι εύκολη στην Elixir. Θα διερευνήσουμε πώς να αξιοποιήσουμε τις βιβλιοθήκες για να κάνουμε αυτήν την εργασία ακόμα πιο εύκολη.
es: El procesamiento de grandes cantidades de datos concurrentemente es fácil en Elixir. Exploraremos cómo aprovechar las bibliotecas para hacer esta tarea aún más fácil.
ja: Elixirでは、大量のデータを同時に処理することは容易です。ここでは、このタスクをより簡単にするためのライブラリの活用方法を探ります。
no: Å prosessere store mengder data samtidig er enkelt i Elixir. Vi kommer til å utforske hvordan vi kan bruke biblioteker for å gjøre denne oppgaven enda enklere.

source: Project
el: Έργο
es: Proyecto
ja: プロジェクト
no: Prosjekt

source: Request your invite today!
el: Ζητήστε την πρόσκλησή σας σήμερα!
es: ¡Solicite su invitación hoy!
ja: 今すぐ招待をリクエスト！
no: Be om din invitasjon i dag!

source: Reviews
el: Κριτικές
es: Reseñas
ja: レビュー
no: Anmeldelser

source: See Them Here
el: Δείτε εδώ
es: Miralos aquí
ja: ここから見る
no: Se dem her

source: See something you think should be improved? Feel free to open an issue or create a pull request with the change.
el: Βλέπετε κάτι που πιστεύετε ότι πρέπει να βελτιωθεί; Μη διστάσετε να ανοίξετε ένα ζήτημα ή να δημιουργήσετε ένα pull request με την αλλαγή.
es: ¿Ves algo que crees que debería mejorarse? No dudes en abrir un problema o crear una solicitud de extracción con el cambio.
ja: 改善すべき点が見つかりましたか？今すぐissueとプルリクエストを作成してみましょう。
no: Ser du noe som du mener burde bli forbedret? Vi setter veldig pris på om du åpner en sak eller oppretter en pull request med forslag til endring.

source: Sign up for our newsletter
el: Εγγραφείτε στο newsletter μας
es: Regístrate para nuestro boletín
ja: ニュースレターにサインアップ
no: Meld deg på vårt nyhetsbrev

source: Since functions are first class citizens in Functional Programming we're able to easily re-use our functions throughout our applications.
el: Δεδομένου ότι οι συναρτήσεις είναι πολίτες πρώτης κατηγορίας στον συναρτησιακό Προγραμματισμό, είμαστε σε θέση να επαναχρησιμοποιούμε εύκολα τις συναρτήσεις μας σε όλες τις εφαρμογές μας.
es: Como las funciones son ciudadanos de primera clase en la programación funcional, podemos reutilizar fácilmente nuestras funciones en toda nuestra aplicación.
ja: 関数型プログラミングでは、関数は第一級市民なので、アプリケーション全体で関数を簡単に再利用することができます。
no: Siden funksjoner er fundamentet til funksjonell programmering, kan vi enkelt gjenbruke funksjonene våre i hele applikasjonen.

source: Still not convinced? Here are some numbers that demonstrate Elixir's growth and reach.
el: Ακόμα δεν έχετε πειστεί; Εδώ είναι μερικοί αριθμοί που δείχνουν την ανάπτυξη και την εμβέλεια της Elixir.
es: ¿Todavía no estás convencido? Aquí hay algunos números que demuestran el crecimiento y alcance de Elixir.
ja: まだ納得がいかない？Elixirの成長とリーチを物語る数字をご紹介します。
no: Fortsatt ikke overbevist? Her er noen tall som viser Elixirs vekst og rekkevide.

source: Table of Contents
el: Πίνακας περιεχομένων
es: Tabla de contenidos
ja: 目次
no: Innholdsfortegnelse

source: Take a look at the
el: Ρίξτε μια ματιά στα
es: Mira el
ja: リポジトリにある
no: Ta en titt på

source: Taking our knowledge to the next level, these lessons get cover the advanced topics of Elixir and the BEAM.
el: Μεταφέροντας τις γνώσεις μας στο επόμενο επίπεδο, αυτά τα μαθήματα καλύπτουν τα προχωρημένα θέματα των Elixir και BEAM.
es: Tomando nuestro conocimiento al siguiente nivel, estas lecciones cubren los temas avanzados de Elixir y el BEAM.
ja: 私たちの知識を次のレベルへ上げるため、このレッスンでは、ElixirとBEAMの高度なトピックをカバーします。
no: La oss ta kunnskapen vår til det neste nivået. Disse leksjonene dekker avanserte emner innen Elixir og BEAM.

source: The Elixir Slack is a popular destination for many in the community.
el: Το Elixir Slack είναι ένας δημοφιλής προορισμός για πολλούς στην κοινότητα.
es: El Slack de Elixir es un destino popular para muchos en la comunidad.
ja: Elixir Slackは、コミュニティの多くの人が利用しています。
no: Elixir-slacken er et populært knytepunkt for mange i Elixir-fellesskapet.

source: The community and ecosystem that have grown up with the language remain one of the alluring parts of Elixir.
el: Η κοινότητα και το οικοσύστημα που έχουν μεγαλώσει με τη γλώσσα παραμένουν ένα από τα σαγηνευτικά μέρη της Elixir.
es: La comunidad y el ecosistema que han crecido con el lenguaje siguen siendo una de las partes atractivas de Elixir.
ja: この言語とともに成長してきたコミュニティやエコシステムは、今もElixirの魅力の一つです。
no: Fellesskapet og økosystemet som har vokst opp med og rundt språket, er en av de mest tiltalende aspektene av Elixir.

source: The first step to writing fault tolerant and scalable code is writing bug free code. In these lessons we explore how best to test our Elixir code.
el: Το πρώτο βήμα για τη σύνταξη κώδικα με ανοχή σφαλμάτων και κλιμάκωση είναι η σύνταξη κώδικα χωρίς σφάλματα. Σε αυτά τα μαθήματα εξερευνούμε τον καλύτερο τρόπο δοκιμής του Elixir κώδικα μας.
es: El primer paso para escribir código tolerante a fallos y escalable es escribir código sin errores. En estas lecciones exploramos cómo probar mejor nuestro código Elixir.
ja: 耐障害性と拡張性のあるコードを書くための最初のステップは、バグのないコードを書くことです。このレッスンでは、Elixirのコードをどのようにテストするのがベストなのかを探求します。
no: Første steg for å skrive feil-tolerant og skalerbar kode, er å skrive feilfri kode. I disse leksjonene utforsker vi hvordan vi tester Elixir-koden vår på best mulig måte.

source: The page you're looking for seems to be missing.
el: Η σελίδα που ψάχνετε φαίνεται να λείπει.
es: La página que estás buscando parece que falta.
ja: お探しのページがないようです。
no: Vi kunne ikke finne siden du så etter.

source: The premier destination for learning and mastering Elixir
el: Ο κορυφαίος προορισμός για εκμάθηση και εξοικείωση με την Elixir
es: El destino de referencia para aprender y dominar Elixir
ja: Elixirを学び、マスターするための最高の場所
no: Det beste stedet for å lære og mestre Elixir

source: The very nature of functional programming, small functions with no side-effects, makes testing easy.
el: Η ίδια η φύση του συναρτησιακού προγραμματισμού, οι μικρές συναρτήσεις χωρίς παρενέργειες, κάνουν τη δοκιμή εύκολη.
es: La naturaleza misma de la programación funcional, pequeñas funciones sin efectos secundarios, hace que la prueba sea fácil.
ja: 関数型プログラミングの本質である、副作用のない小さな関数は、テストを容易にしてくれます。
no: Fundamentet til funksjonell programmering, nemlig små funksjoner uten side-effekter, gjør testing enkelt.

source: These "pure functions" always produce the same results for a given input and change nothing.
el: Αυτές οι "καθαρές συναρτήσεις" παράγουν πάντα τα ίδια αποτελέσματα για μια δεδομένη είσοδο και δεν αλλάζουν τίποτα.
es: Estas "funciones puras" siempre producen los mismos resultados para una entrada dada y no cambian nada.
ja: このような「純粋関数」は、与えられた入力に対して常に同じ結果を生成し、何も変化させません。
no: Disse "rene funksjonene" produserer alltid de samme resultatene for en gitt input, uten å endre noe.

source: This has the added benefit of improving support for concurrency and thus scalability of systems.
el: Αυτό έχει το πρόσθετο πλεονέκτημα της βελτίωσης της υποστήριξης για ταυτόχρονη χρήση και συνεπώς επεκτασιμότητα των συστημάτων.
es: Esto tiene el beneficio adicional de mejorar el soporte para la concurrencia y, por lo tanto, la escalabilidad de los sistemas.
ja: これにより、並行処理のサポートが向上し、システムのスケーラビリティが向上するというメリットもあります。
no: Dette har også en ekstra positiv effekt av å forbedre støtten for concurrency og dermed skalerbarhet av systemer.

source: This is a great way to contribute and get visibility for your post! Steps for submitting a post are available on
el: Αυτός είναι ένας πολύ καλός τρόπος για να συνεισφέρετε και να έχετε ορατότητα για την ανάρτησή σας! Τα βήματα για την υποβολή μιας ανάρτησης είναι διαθέσιμα στο
es: ¡Esta es una gran manera de contribuir y obtener visibilidad para tu publicación! Los pasos para enviar una publicación están disponibles en
ja: これは投稿して知名度を上げるのに最適な方法です！投稿の手順は、次のサイトでご覧いただけます：
no: Dette er en flott måte å bidra på, og få synlighet for ditt innlegget! Stegene for å sende inn et innlegg er tilgjengelig på

source: Through the hard work of volunteers Elixir School has been translated to many languages. Some of these translations include:
el: Μέσα από τη σκληρή δουλειά των εθελοντών το Elixir School έχει μεταφραστεί σε πολλές γλώσσες. Μερικές από αυτές τις μεταφράσεις περιλαμβάνουν:
es: Gracias al trabajo duro de voluntarios, Elixir School se ha traducido a muchos idiomas. Algunas de estas traducciones incluyen:
ja: ボランティアの方々の努力により、Elixir Schoolは多くの言語に翻訳されています。その中には次のような翻訳があります:
no: Gjennom det harde arbeidet til frivillige, har Elixir School blitt oversatt til mange språk. Noen av disse oversettelsene inkluderer:

source: Today I Learned (TIL)
es: Hoy aprendí (TIL)
ja: 今日の学び（TIL）
no: I dag lærte jeg (TIL)

source: Translate Lessons
el: Μεταφράστε Μαθήματα
es: Traducir lecciones
ja: レッスンを翻訳
no: Oversett leksjoner

source: Translation unavailable
el: Η μετάφραση δεν είναι διαθέσιμη
es: Traducción no disponible
ja: 訳されていません
no: Oversettelse mangler

source: Translations
el: Μεταφράσεις
es: Traducciones
ja: 対応
no: Oversettelser

source: Using Elixir
el: Χρήσιμοποιούν Elixir
es: Usando Elixir
ja: Elixirを使用しています
no: Bruke Elixir

source: Vibrant Ecosystem
el: Ζωντανό οικοσύστημα
es: Ecosistema vibrante
ja: 活気あるエコシステム
no: Levende økosystem

source: Want to learn more?
el: Θέλετε να μάθετε περισσότερα;
es: ¿Quieres aprender más?
ja: もっと知りたいですか？
no: Lyst til å lære mer?

source: We care about the protection of your data. Read our
el: Μας ενδιαφέρει η προστασία των δεδομένων σας. Διαβάστε
es: Nos preocupamos por la protección de sus datos. Lea nuestro
ja: 私たちは、お客様のデータの保護に配慮しています。
no: Vi bryr oss om beskyttelsen av dine data. Les vår

source: We have articles spanning several topics
el: Έχουμε άρθρα που καλύπτουν πολλά θέματα
es: Tenemos artículos que abarcan varios temas
ja: 色んなトピックの記事があります
no: Vi har artikler som dekker flere emner

source: We welcome and encourage you to join us in continuing to make Elixir School great by getting involved at elixirschool/elixirschool!
el: Σας καλωσορίζουμε και σας ενθαρρύνουμε να συμμετάσχετε μαζί μας για να συνεχίσουμε να κάνουμε το Elixir School υπέροχο συμμετέχοντας στο elixirschool/elixirschool!
es: ¡Te damos la bienvenida y te animamos a que te unas a nosotros para continuar haciendo que Elixir School sea genial al involucrarte en elixirschool/elixirschool!
ja: elixirschool/elixirschoolに参加することで、私たちと一緒にElixir Schoolを盛り上げてください！
no: Vi ønsker og oppfordrer deg til å bli med oss i å fortsette å gjøre Elixir School enda bedre ved å bli involvert på elixirschool/elixirschool!

source: We're sorry, the resource you're looking for has not been translated yet.
el: Λυπούμαστε, ο πόρος που αναζητάτε δεν έχει μεταφραστεί ακόμα.
es: Lo sentimos, el recurso que está buscando aún no se ha traducido.
ja: 申し訳ありません。お探しのリソースはまだ翻訳されていません。
no: Vi beklager, ressursen du leter etter har ikke blitt oversatt ennå.

source: Welcome to Elixir School!
el: Καλώς ήρθατε στο Elixir School!
es: ¡Bienvenido a Elixir School!
ja: Elixir Schoolへようこそ！
no: Velkommen til Elixir School!

source: Whether you’re a seasoned veteran or this is your first time, you’ll find what you need in lessons and auxiliary resources.
el: Είτε είστε έμπειρος βετεράνος είτε αυτή είναι η πρώτη σας φορά, θα βρείτε αυτό που χρειάζεστε σε μαθήματα και βοηθητικούς πόρους.
es: Ya seas un veterano experimentado o esta sea tu primera vez, encontrarás lo que necesitas en lecciones y recursos auxiliares.
ja: ベテランの方も、初めての方も、レッスンや補助教材で必要なものが見つかるはずです。

source: While its roots are in lambda calculus, functional programming can be fun, easy, and approachable for everyone! By focusing on breaking problems down into simple, side-effect free, functions we can ensure fewer bugs, better test coverage, while incrementally building our solutions through the composition of well tested functions.
el: Ενώ οι ρίζες του βρίσκονται στον λογισμό λάμδα, ο συναρτησιακός προγραμματισμός μπορεί να είναι διασκεδαστικός, εύκολος και προσιτός για όλους! Εστιάζοντας στην κατανομή των προβλημάτων σε απλές λειτουργίες χωρίς παρενέργειες, μπορούμε να εξασφαλίσουμε λιγότερα σφάλματα, καλύτερη κάλυψη δοκιμών, ενώ χτίζουμε σταδιακά τις λύσεις μας μέσω της σύνθεσης καλά δοκιμασμένων λειτουργιών.
es: Aunque sus raíces están en el cálculo lambda, ¡la programación funcional puede ser divertida, fácil y accesible para todos! Al centrarnos en dividir los problemas en funciones simples, sin efectos secundarios, podemos asegurar menos errores, mejor cobertura de pruebas, mientras construimos nuestras soluciones de forma incremental a través de la composición de funciones bien probadas.
ja: ラムダ計算をルーツとする関数型プログラミングは、楽しく、簡単で、誰にでも親しみやすいものです！問題を単純で副作用のない関数に分解することに集中することで、バグを減らし、テストカバレッジを向上させ、よくテストされた関数の組み合わせによって解決策を段階的に構築することができます。
no: Med røtter i lambda-kalkulus, kan funksjonell programmering være morsomt, enkelt og tilgjengelig for alle! Ved å fokusere på å bryte opp problemer inn i enkle funksjoner, fri for side-effekter, kan vi sikre at vi skriver færre feil, får bedre testdekning, mens vi gradvis bygger løsningene våre gjennom sammensetning av godt testede funksjoner.

source: Why Choose Elixir?
el: Γιατί Elixir;
es: ¿Por qué elegir Elixir?
ja: なぜElixirを選ぶのか？
no: Hvorfor velge Elixir?

source: With Lesson
el: Με Μάθημα
es: Con lección
ja: に
no: Med leksjon

source: With dozens of conferences, hundreds of meetups, Slack, IRC, Discord, and multiple active hashtags.
el: Με δεκάδες συνέδρια, εκατοντάδες συναντήσεις, Slack, IRC, Discord και πολλά ενεργά hashtags.
es: Con decenas de conferencias, cientos de reuniones, Slack, IRC, Discord y múltiples hashtags activos.
ja: 何十ものカンファレンス、何百ものミートアップ、SlackやIRC、Discordなど、そして他にもたくさんアクティブなハッシュタグによって。
no: Med titalls konferanser, hundrevis av meetups, Slack, IRC, Discord, og flere aktive hashtagger.

source: With over 150 meetups, you're sure to find local Elixir enthusiasts. Check out
el: Με περισσότερες από 150 συναντήσεις, σίγουρα θα βρείτε τοπικούς λάτρεις της Elixir. Τσεκάρετε
es: Con más de 150 reuniones, ¡seguro que encontrarás entusiastas locales de Elixir! Consulte
ja: 150以上のミートアップがあり、地元のElixir愛好家がきっと見つかるはずです。チェックしてみよう：
no: Med over 150 meetups, finner du lokale Elixir-entusiaster. Se på

source: and
el: και
es: y
ja: と
no: og

source: are available on
el: είναι διαθέσιμα στο
es: están disponibles en
ja: は次で利用可能です：
no: er tilgjengelig på

source: for more.
el: για περισσότερα.
es: para más.
no: for mer.

source: issues
el: θέματα
es: problemas
no: saker

source: on Twitter.
es: en Twitter.
ja: をツイッターでフォロー。
no: på Twitter.

source: on the repository to find a task that interests you. Create a pull request when your change is ready and after review it will be merged into the codebase!
el: στο repository για να βρείτε μια εργασία που σας ενδιαφέρει. Δημιουργήστε ένα pull request όταν η αλλαγή σας είναι έτοιμη και μετά από έλεγχο θα συγχωνευθεί στη βάση!
es: en el repositorio para encontrar una tarea que te interese. ¡Cree una solicitud de extracción cuando su cambio esté listo y después de la revisión se fusionará en la base de código!
ja: を見て、興味のある課題を探してみてください。変更が完了したらプルリクエストを作成し、レビュー後、コードベースにマージされます！
no: på repository for å finne en oppgave som interesserer deg. Opprett en pull request når endringen er klar, og etter gjennomgang vil den bli slått sammen med kodebasen!

source: to join the conversation.
el: για να συμμετάσχετε στη συζήτηση.
es: para unirse a la conversación.
ja: に参加しよう。
no: for å bli med i samtalen.

source: Recent Posts
el: Πρόσφατες δημοσιεύσεις
es: Publicaciones recientes
ja: 最近の投稿
no: Siste innlegg

source: (& Counting)
el: (& Αυξάνονται)
es: (& Contando)
ja: （増加中...）
no: (& Teller)

source: Visit the Blog
el: Επισκεφθείτε το Blog
es: Visita el blog
ja: ブログを見る
no: Besøk bloggen

source: If you speak that language, you can help translate
es: Si habla ese idioma, puede ayudar a traducir
no: Hvis du snakker dette språket, kan du hjelpe oss med å oversette

source: this page
es: esta página
no: denne siden

source: Blog
ja: ブログ
no: Blogg

source: Extensible
el: Επεκτάσιμη
ja: 拡張性
no: Utvidbar

source: Podcasts
ja: ポッドキャスト

source: Coming Soon!
el: Έρχεται σύντομα!

source: on Twitter
el: στο Twitter

source: Whether you're a seasoned veteran or this is your first time, you'll find what you need in lessons and auxiliary resources.
no: Enten du er en erfaren alkymist eller dette er første gangen, vil du finne det du trenger blant våre leksjoner og hjelpemidler.
